In [2]:
import pandas as pd
df = pd.DataFrame({"name": ["Alex", "Andrew"], "age": [25, 25]})
df

     name  age
0    Alex   25
1  Andrew   25

In [3]:
df.loc[df['name'] == "Alex", 'name'] = "Alex Wenner"
df

          name  age
0  Alex Wenner   25
1       Andrew   25

In [4]:
df.loc[df['name'] == "Andrew", 'name'] = "Andrew Brill"
df

           name  age
0   Alex Wenner   25
1  Andrew Brill   25

In [5]:
df.to_csv('names.csv', index=False)
df.to_dict('records')

[{'name': 'Alex Wenner', 'age': 25}, {'name': 'Andrew Brill', 'age': 25}]

In [6]:
df.loc[df['name'] == "Alex Wenner", 'field_of_study'] = "CS"
df

           name  age field_of_study
0   Alex Wenner   25             CS
1  Andrew Brill   25            NaN

In [7]:
df.loc[df['name'] == "Andrew Brill", 'field_of_study'] = "MIS"
df

           name  age field_of_study
0   Alex Wenner   25             CS
1  Andrew Brill   25            MIS

In [8]:
df.columns

Index(['name', 'age', 'field_of_study'], dtype='object')

In [9]:
df.columns = ['person', 'years', 'fos']
df

         person  years  fos
0   Alex Wenner     25   CS
1  Andrew Brill     25  MIS

In [10]:
df.set_index('person', inplace=True)
df

              years  fos
person
Alex Wenner      25   CS
Andrew Brill     25  MIS

In [11]:
df.reset_index(inplace=True)
df

         person  years  fos
0   Alex Wenner     25   CS
1  Andrew Brill     25  MIS

In [13]:
ppl = [{"person" : "John Does", "years" : 40, "fos" : "Business"},  {"person" : "Jane Doe", "years" : 38, "fos" : "Business"}, {"person" : "Bill Doe", "years" : 25, "fos" : "CS"}, {"person" : "Kim Doe", "years" : 25, "fos" : "MIS"}]
ppl

[{'person': 'John Does', 'years': 40, 'fos': 'Business'},
 {'person': 'Jane Doe', 'years': 38, 'fos': 'Business'},
 {'person': 'Bill Doe', 'years': 25, 'fos': 'CS'},
 {'person': 'Kim Doe', 'years': 25, 'fos': 'MIS'}]

In [24]:
df = pd.concat([df, pd.DataFrame(ppl)])
df

         person  years       fos
0   Alex Wenner     25        CS
1  Andrew Brill     25       MIS
0     John Does     40  Business
1      Jane Doe     38  Business
2      Bill Doe     25        CS
3       Kim Doe     25       MIS
0     John Does     40  Business
1      Jane Doe     38  Business
2      Bill Doe     25        CS
3       Kim Doe     25       MIS

In [18]:
print(df.dtypes)

person    object
years      int64
fos       object
dtype: object

In [19]:
df.loc[df['years'] > 30]

      person  years       fos
0  John Does     40  Business
1   Jane Doe     38  Business

In [23]:
df.loc[(df['years'] < 30) & (df['fos'] == "CS")]

        person  years fos
0  Alex Wenner     25  CS
2     Bill Doe     25  CS